# 1、起始行（Unix）
        通常只有在类 Unix 环境下才使用起始行，有起始行就能够仅输入脚本名字来执行脚本，无需直接调用解释器。
# 2、模块文档
    简要介绍模块的功能及仲要全局变量的含义，模块外可通过module.__doc__访问这些类容
# 3、模块导入
    导入当前模块代码所需要的模块；每个模块仅导入一次（当前模块没加载时）；函数内部的模块导入代码不回被执行，除非该函数正在执行
# 4、变量定义
    除非必须，否则尽量使用局部变量代替全局变量，--容易维护，且提高性能节省内存
# 5、类定义
    所有的类都要在这里定义，当模块被导入时class 语句会被执行，类也就会被定义，类的文档变量是clas.__dac__
# 6、函数定义
    此处的函数定义可以通过module.function()在外部被访问到，当模块被导入时 def 语句会被执行，函数也就都定义好，函数的文档变量是function.__doc__j
# 7、主程序
    无论这个模块是被别的模块导入还是作为脚本直接执行，都会执行这部分代码。通常这里不会有太多功能性代码，而是根据执行的模式调用不同的函数。

